In [6]:
import pandas as pd

In [26]:
data = {
    'Yil': [2021, 2020, 2019, 2018, 2017],
    'Aholi soni': [33.9, 33.5, 32.9, 32.5, 31.9],
    'Temp': [1.54, 1.48, 1.56, 1.62, 1.65]
}

In [9]:
df = pd.DataFrame(data)

In [11]:
print(df)

    Yil  Aholi  Temp
0  2021   33.9  1.54
1  2020   33.5  1.48
2  2019   32.9  1.56
3  2018   32.5  1.62
4  2017   31.9  1.65

In [12]:
df.head() # default 5

    Yil  Aholi  Temp
0  2021   33.9  1.54
1  2020   33.5  1.48
2  2019   32.9  1.56
3  2018   32.5  1.62
4  2017   31.9  1.65

In [13]:
df.shape

(5, 3)

In [28]:
df = pd.DataFrame(data, columns=['Yil', 'Temp', 'Aholi soni'])
df

    Yil  Temp  Aholi soni
0  2021  1.54        33.9
1  2020  1.48        33.5
2  2019  1.56        32.9
3  2018  1.62        32.5
4  2017  1.65        31.9

In [30]:
df = pd.DataFrame(data, columns=['Yil', 'Temp', 'Aholi soni'], index = ['a', 'b', 'c', 'd', 'e'])

In [31]:
df

    Yil  Temp  Aholi soni
a  2021  1.54        33.9
b  2020  1.48        33.5
c  2019  1.56        32.9
d  2018  1.62        32.5
e  2017  1.65        31.9

In [32]:
 data['Aholi soni']

[33.9, 33.5, 32.9, 32.5, 31.9]

In [33]:
aholi = df['Aholi soni']

In [34]:
aholi

a    33.9
b    33.5
c    32.9
d    32.5
e    31.9
Name: Aholi soni, dtype: float64

In [36]:
type(aholi)

pandas.core.series.Series

In [37]:
df.Temp

a    1.54
b    1.48
c    1.56
d    1.62
e    1.65
Name: Temp, dtype: float64

In [38]:
df = pd.DataFrame(data, columns=['Yil', 'Temp', 'Aholi soni', 'Yim'], index = ['a', 'b', 'c', 'd', 'e'])

In [39]:
df

    Yil  Temp  Aholi soni  Yim
a  2021  1.54        33.9  NaN
b  2020  1.48        33.5  NaN
c  2019  1.56        32.9  NaN
d  2018  1.62        32.5  NaN
e  2017  1.65        31.9  NaN

In [40]:
df.Yim =0

In [41]:
df

    Yil  Temp  Aholi soni  Yim
a  2021  1.54        33.9    0
b  2020  1.48        33.5    0
c  2019  1.56        32.9    0
d  2018  1.62        32.5    0
e  2017  1.65        31.9    0

In [42]:
val = pd.Series([1700, 1650, 1300], index=['a', 'b', 'd'])
df.Yim = val

In [43]:
df

    Yil  Temp  Aholi soni     Yim
a  2021  1.54        33.9  1700.0
b  2020  1.48        33.5  1650.0
c  2019  1.56        32.9     NaN
d  2018  1.62        32.5  1300.0
e  2017  1.65        31.9     NaN

In [48]:
val = [1,2,3,4,5]
df.Yim = val

In [49]:
df

   Yil  Temp  Aholi soni  Yim
a    1  1.54        33.9    1
b    2  1.48        33.5    2
c    3  1.56        32.9    3
d    4  1.62        32.5    4
e    5  1.65        31.9    5

In [51]:
df['1+'] = df.Yim>1

In [52]:
df

   Yil  Temp  Aholi soni  Yim     1+
a    1  1.54        33.9    1  False
b    2  1.48        33.5    2   True
c    3  1.56        32.9    3   True
d    4  1.62        32.5    4   True
e    5  1.65        31.9    5   True

In [53]:
del df['1+']

In [54]:
df

   Yil  Temp  Aholi soni  Yim
a    1  1.54        33.9    1
b    2  1.48        33.5    2
c    3  1.56        32.9    3
d    4  1.62        32.5    4
e    5  1.65        31.9    5

In [55]:
data = {
    'Uzbekistan':{2021:33.9, 2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9},
    'Kazakhstan':{2021:18.9, 2020:18.7, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8}
}
df2 = pd.DataFrame(data)

In [56]:
df2

      Uzbekistan  Kazakhstan
2021        33.9        18.9
2020        33.5        18.7
2019        32.9        18.5
2018        32.5        18.3
2017        31.9        18.1
2016         NaN        17.8

In [57]:
df2.index.name = 'Yil'

In [58]:
df2

      Uzbekistan  Kazakhstan
Yil
2021        33.9        18.9
2020        33.5        18.7
2019        32.9        18.5
2018        32.5        18.3
2017        31.9        18.1
2016         NaN        17.8

In [59]:
df2 = DataFrame(data, index=[2021, 2019, 2017]) # 2021, 2019 va 2017 yil ma'lumotlarini olamiz

In [60]:
df2

      Uzbekistan  Kazakhstan
2021        33.9        18.9
2019        32.9        18.5
2017        31.9        18.1

In [61]:
df2.index.name = 'YIl'

In [62]:
df2

      Uzbekistan  Kazakhstan
YIl
2021        33.9        18.9
2019        32.9        18.5
2017        31.9        18.1

In [63]:
df2.T

YIl         2021  2019  2017
Uzbekistan  33.9  32.9  31.9
Kazakhstan  18.9  18.5  18.1

In [65]:
arr = df2.values

In [66]:
arr

array([[33.9, 18.9],
       [32.9, 18.5],
       [31.9, 18.1]])

In [1]:
print(arr)

NameError: name 'arr' is not defined